[
    {
      "title": "30 listopada 2023",
      "cardTitle": "Pierwsze spotkanie koła",
      "cardSubtitle":
        "Kick-off meeting Work In Progress - spotkanie które zaczęło wszystko!",
      "cardDetailedText": "Details",
      "media": {
        "type": "IMAGE",
        "source": {
          "url": "http://someurl/image.jpg"
        }
      }
    },
    {
      title: "6 grudnia 2023",
      cardTitle: "Mikołajki UG",
      cardSubtitle: "Pierwsza publiczna prezentacja koła",
      cardDetailedText:
        "Details - pierwszy WIP Quest, ciastka korzenne w nagrodę (: Nasze pierwsze wystąpienie jako koła podczas obchodów Mikołajek. Pierwszy projekt strony do prezentowania na róznych dniach otwartych oraz nasza pierwsza łamigłówka, która miała zmotywować do interakcji z nami. Niesamowite ile czasu minęło i ile się wydarzyło od tego momentu :D",
      media: {
        type: "IMAGE",
        source: {
          url: "http://someurl/image.jpg",
        },
      },
    },
    {
      title: "10-11 stycznia 2024",
      cardTitle: "BEST Coding Marathon (kliknij, żeby przeczytać artykuł)",
      url: "https://mfi.ug.edu.pl/news/111910/sukces-studentow-wydzialu-mfi",
      cardSubtitle: "Pierwszy event poza uniwersytetem",
      cardDetailedText: "Details - gościnnie Dominik Krakowski z koła NaN++",
      media: {
        type: "IMAGE",
        source: {
          url: "http://someurl/image.jpg",
        },
      },
    },
    {
      title: "6 lutego 2024",
      cardTitle: "Utworzenie i złoszenie statutu koła",
      cardSubtitle: "Pierwszy ważny krok do zoficjalizowania Work In Progress",
      cardDetailedText:
        "Details - do tej pory nasze koło działało bez oficjalnej pozycji. Było cięzko, bez mozliwości korzystania z benefitów uczelni. Od tamtego momentu pręznie się rozwijamy i dzięki pomocy jaką oferuje uczelnia kołom naukowym, mocno rozwinęliśmy skrzydła.",
      media: {
        type: "IMAGE",
        source: {
          url: "http://someurl/tutaj można wrzucić screen naszego statutu.jpg",
        },
      },
    },
    {
      title: "26 lutego 2024",
      cardTitle: "Pierwszy wykład WIP",
      cardSubtitle: "ToDo",
      cardDetailedText:
        "Details - jednym z celów naszego koła było wsparcie młodszego rocznika naszych studiów... Był to świetny sposób na integrację między rocznikami oraz pomoc w trudniejszych przedmiotach na naszej uczelni, a do tego doskonała okazja by rekrutować nowych entuzjastów webówki. Nam pomogło to rozwinąć umiejętności miękkie oraz to co potrzebne do dobrego prezentowania wiedzy.",
      media: {
        type: "IMAGE",
        source: {
          url: "http://someurl/image.jpg",
        },
      },
    },
    {
      title: "4 marca 2024",
      cardTitle:
        "Stworzenie aplikacji PathFinder (kliknij, żeby zobaczyć apkę)",
      url: "https://pathfinder.ug.edu.pl/",
      cardSubtitle:
        "Podjęliśmy się stworzenia aplikacji na targi Edu Offshore promującej kierunki naszego uniwersytetu",
      cardDetailedText:
        "Details - było to wielkie wyzwanie dla naszego zespołu, mieliśmy niespełna tydzień, żeby stworzyć funkcjonalną aplikację dla setek odwiedzających, którzy mogli za jej pomocą sprawdzić na jaki kierunek w UG powinni się wybrać. Wyzwanie nauczyło nas wielu cennych rzeczy, których na codzień nie mieliśmy okazji zrobić na studiach. Umiejętność pracy w grupie, git flow oraz odpowiednia metodyka pracy (oczywiście przyspieszona z racji na krytyczny deadline) okazały się kluczowe i pomogły nam zrozumieć dlaczego jest to tak wazne w projekcie" ,
      media: {
        type: "IMAGE",
        source: {
          url: "http://someurl/image.jpg",
        },
      },
    },
    {
      "title": "12-13 marca 2024",
      "cardTitle": "Dni otwarte UG (kliknij)",
      "url": "https://dniotwarte.ug.edu.pl/",
      "cardSubtitle": "",
      "cardDetailedText":
        "Details - było to ważne wydarzenie dla nas jako koła, ale przede wszystkim dla uniwersytetu. Mieliśmy okazję poznać inne koła działające nie tylko na naszym wydziale, ale równiez na całym kampusie. Znów działaliśmy i zachęcaliśmy do interakcji z nami poprzez zadania do rozwiązania za nagrody. Była to dla nas porządna lekcja jak podchodzić do licealistów, czyli ludzi bez doświadczenia i szerokiej wiedzy o informatyce. Zachęcaliśmy równiez do aplikowania w przyszłości na kierunki informatyczne na naszym wydziale.",
      "media": {
        "type": "IMAGE",
        "source": {
          "url": "http://someurl/image.jpg"
        }
      }
    },
    {
      "title": "19 marca 2024",
      "cardTitle": "Oficjalna formalizacja koła",
      "cardSubtitle":
        "Po ponad miesiącu oczekiwania udało się w końcu zoficjalizować działaność Work In Progress",
      "cardDetailedText":
        "Details - od tej pory mogliśmy się oficjalnie nazywać Kołem Naukowym Uniwersytetu Gdańskiego",
      "media": {
        "type": "IMAGE",
        "source": {
          "url": "http://someurl/image.jpg"
        }
      }
    },
    {
      "title": "22-23 marca 2024",
      "cardTitle": "Heart4hack! - społeczny hackathon (kliknij)",
      "url": "https://evenea.pl/pl/wydarzenie/heart4hack2024",
      "cardSubtitle": "Drugi występ WIPu na hackathonie, tym razem społecznym",
      "cardDetailedText":
        "Details - poznaliśmy mnóstwo nowych i ciekawych osób, stworzyliśmy koncept aplikacji, która miała łączyć mentorów i osób chcących nauczyć się programowania",
      "media": {
        "type": "IMAGE",
        "source": {
          "url": "http://someurl/image.jpg"
        }
      }
    },
    {
      "title": "11-13 czerwca 2024",
      "cardTitle": "Women In Tech Summit :D (kliknij)",
      "url": "https://womenintechsummit.pl/",
      "cardSubtitle": "I tak znaleźliśmy się tutaj! (:",
      "cardDetailedText":
        "Details - Przyjechaliśmy tutaj, zeby godnie reprezentować uczelnię oraz jako koło naukowe pokazać się szerszej publiczności. W naszym repertuarze mamy do pokazania nasze dotychczasowe osiągnięcia oraz specjalnie przygotowane łamigłówki dla początkujących programistów",
      "media": {
        "type": "IMAGE",
        "source": {
          "url": "http://someurl/image.jpg"
        }
      }
    }
  ]